OpenFOAM-11/tutorials/multiphaseEuler/bubblePipe/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,alpha)            Gauss vanLeer;
    div(phir,alpha,alpha)   Gauss vanLeer;

    div(alphaRhoPhi,U)      Gauss linearUpwind limited;
    div(phi,U)              Gauss linearUpwind limited;
    "div\(alphaRhoPhi,(k|epsilon|omega)\)"    Gauss limitedLinear 1;
    "div\(alphaPhi,f.*\)"         Gauss limitedLinear 1;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

wallDist
{
    method          Poisson;
    nRequired       true;
}

// ************************************************************************* //
